{
    "Changes": [
        {
            ".LogName": "Load/Create Djinn character",
            "Action": "Load",
            "Target": "Characters/Dialogue/Djinn, Characters/Dialogue/MarriageDialogueDjinn, Characters/Schedules/Djinn, Strings/Schedules/Djinn",
            "FromFile": "code/blank.json"
        },
        {
            ".LogName": "Edit Djinn character data",
            "Action": "EditData",
            "Target": "Data/Characters",
            "Entries": {
                "Djinn": {
                    "DisplayName": "{{i18n:Djinn_StringData.Characters_DisplayName |MPP_EK_Djinn_Name={{MPP_EK_Djinn_Name_T}} }}",
                    "Gender": "female",
                    "Age": "Adult",
                    "BirthSeason": "Spring",
                    "BirthDay": 14,
                    "HomeRegion": "Other",
                    "Manner": "Polite",
                    "SocialAnxiety": "Outgoing",
                    "Optimism": "Positive",

                    "CanSocialize": true,
                    "CanGreetNearbyCharacters": true,
                    "CanBeRomanced": false,
                    "KissSpriteIndex": 33,
                    "KissSpriteFacingRight": false,
                    "CanReceiveGifts": true,
                    "CanVisitIsland": false,
                    "Caledar": "HiddenUntilMet",
                    "SocialTab": "HiddenUntilMet",
                    "SpouseWantsChildren": true,
                    "SpouseGiftJealousy": true,
                    "PerfectionScore": false,

                    "DumpsterDiveFriendshipEffect": -25,
                    "FlowerDanceCanDance": false,
                    "WinterStarParticipant": true,
                    
                    "Home": [
                        {
                            "Id": "Default",
                            "Location": "SandyHouse",
                            "Tile": { "X": -100   , "Y": -100 },
                            "Direction": "Left"
                        }
                    ],
                    "TextureName": null,
                    "Size": {
                        "X": 16,
                        "Y": 32
                    }
                }
            }
        },
        // {
        //     "LogName": "Enable dating Djinn",
        //     "Action": "EditData",
        //     "Target": "Data/Characters",
        //     "Entries": {
        //         "Djinn": {
        //             "CanBeRomanced": true,
        //             "CanVisitIsland": true,
        //             "FlowerDanceCanDance": true
        //         }
        //     },
        //     "When": {
        //         "HasSeenEvent |contains=2523800107": true
        //     }
        // },

        {
            ".LogName": "Edit Djinn gift tastes",
            "Action": "EditData",
            "Target": "Data/NPCGiftTastes",
            "Entries": {
                "Djinn": "/279 253 226 74 82 90 373 578/ /395 215 260 64 68 88 164 165 903/ /84 412 416 721 142 457 161 342/ /247 265 868 308 167 229 172 168/ / /"
            }
        },

        {
            ".LogName": "Edit Djinn standard dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/Djinn",
            "Entries": {
                "Location_Entry": "Welcome! Are you here to browse or are you just admiring the best new shopkeeper in the valley?$10 That's me, by the way!$1",
                "GreenRain": "Whoa! What is happening?!$3 The sky is... green! This is so weird and exciting!$10 I need to take notes, this could be a huge tourist draw!$1",
                "GreenRain_2": "It's another Green Rain!$1 I've got my data-gathering kit all ready this time. Think of the unique, mossy products we could market!$10",
                "DumpsterDiveComment": "Hey! What are you doing in that trash can?!$3 If you're that hard up for cash, I've got plenty of work that needs doing.$5 Honestly, have some self-respect.$8",
                "HitBySlingshot": "OW!$3 Did you just shoot something at me?!$5 Watch where you're pointing that thing, butterfingers!$8",

                "Resort": "This place is incredible!$10 The amenities, the coordinated staff uniforms, the sheer volume of customers! I'm taking SO many notes for the Oasis!$1",
                "Resort_Bar": "A drink in the sun? Yes please!$1 This is the life! I feel a new sales strategy bubbling up!$10",
                "Resort_Chair": "Don't mind me, just soaking up the sun and doing some market research.$9 Ahh, perfection.$1",
                "Resort_Dance": "Woo! I love this music!$10 It really gets the blood pumping!$1",
                "Resort_Entering": "I've arrived!$10 Time to see what all the fuss is about. I bet our desert hospitality is warmer, though.$1",
                "Resort_Leaving": "Aww, time to go already?$2 I got so many good ideas today! I feel energized and ready for business!$1",
                "Resort_Shore": "The ocean is huge!$3 It's a little intimidating compared to a nice, predictable oasis, but the sound is nice.$6",
                "Resort_Towel": "Gotta make sure I don't get sand everywhere.$0 It's a professional hazard.$1",
                "Resort_Umbrella": "This shade is nice, but I live in a desert, I can take the heat!$1 The sun gives me energy!$10",
                "Resort_Wander": "So much to see, so many business practices to analyze!$10 This is better than any seminar!$1",

                "SpouseFarmhouseClutter": "My ember, I nearly tripped on this on my way to the kitchen!$3 Let's clear a path, okay? Safety first, profits second!$0",
                "SpouseGiftJealous": "Oh, for them?$6 That's... nice of you to think of them.$7 I'm sure they'll appreciate it.$8",
                "Spouse_MonstersInHouse": "A monster! In our house!$3 My sandsong, get behind me! I'll... uh... distract it with a dazzling sales pitch!$5",
                "SpouseStardrop": "My glow... is this for me?$2 It tastes like a thousand desert sunrises combined into one.$9 Thank you... for everything you are.$4",

                "breakUp": "A... wilted bouquet?$3 What does this mean? Are you... breaking up with me?$2 I... I think I need to be alone right now.$7",
                "divorced": "Oh. It's you.$8 I'm extremely busy with inventory today, so if you'll excuse me.$6",
                "WipedMemory": "Hey there! You look like you've got some pep in your step!$10 I'm Djinn! I've got big plans for this valley, you just wait and see!$1",

                "AcceptGift_(O)226": "Spicy Eel! Yes!$10 The perfect fuel for a long day of making sales! You're the best!$4",
                "AcceptGift_(O)82": "A Fire Quartz!$10 It's like holding a tiny, personal sun. It's beautiful, thank you!$9",
                "AcceptGift_(O)279": "Magic Rock Candy?! Are you serious?!$3 This is amazing! Thank you so much, this is the best!$10",
                "AcceptGift_Loved": "WOW! This is absolutely fantastic!$10 You really know the way to a girl's heart! Thank you!$4",
                "AcceptGift_Liked": "Ooh, for me? This is great!$1 I really like it, thank you for thinking of me.$4",
                "AcceptGift_Neutral": "Oh, thanks.$0 I can find a use for this, I'm sure.$6",
                "AcceptGift_Disliked": "Um... thanks?$6 I'm not really a fan of this kind of thing, but... it's the thought that counts, I guess.$7",
                "AcceptGift_Hated": "Ugh, what IS this?$5 Get it away from me! Do I look like someone who wants... this?!$8",

                "AcceptBirthdayGift_Loved": "For my birthday?! And it's my favorite!$3 This is the best birthday I've ever had! Thank you, thank you, thank you!$9",
                "AcceptBirthdayGift_Liked": "A birthday gift! You remembered!$4 This is so thoughtful, thank you so much, @. It really means a lot.$9",
                "AcceptBirthdayGift_Neutral": "Oh, a gift for my birthday.$0 Thanks for remembering.$6",
                "AcceptBirthdayGift_Disliked": "It's my birthday... and you got me this?$7 Oh. Well... thanks, I guess.$2",
                "AcceptBirthdayGift_Hated": "Are you kidding me?!$5 On my BIRTHDAY of all days?! Just... go.$8",

                "AcceptBouquet": "For... me?$4 After everything you've helped me with... I... Yes! Of course, yes!$9 I was really hoping you felt the same way!$10",
                
                "MovieInvitation": "A movie?! Heck yeah, I'm in!$10 I could use a break from staring at sales figures. Just tell me when and where!$1",
                "RejectMovieTicket_DontWantToSeeThatMovie" : "A horror movie? No way!$5 I deal with enough stress at work, I don't need to be scared for fun!$8",
                "RejectMovieTicket_AlreadyWatchedThisWeek" : "Whoa there, eager beaver!$1 I already saw a movie this week. My brain needs time to process all that cinematic data!$0",
                "RejectMovieTicket_AlreadyInvitedBySomeoneElse" : "Aw, sorry!$2 Someone else already invited me. Maybe next time!$0",
                "RejectMovieTicket_Divorced" : "Going to the movies with you?$8 I think I'd rather count grains of sand. Individually.$5",

                "RejectItem_(O)168": "Is this a joke?$5 Don't give me your trash. I'm not a garbage can.$8",
                "RejectGift_Divorced": "I don't want anything from you.$8",
                "RejectBouquet_LowHearts": "Whoa there!$3 I like your enthusiasm, but I think we should get to know each other better first. Let's not rush things!$0",
                "RejectBouquet_Divorced": "You must be joking.$5 After everything that happened? The answer is no. Now, please leave.$8",

                "RejectMermaidPendant_Under10Hearts": "Oh! @, I... I'm flattered, I really am.$4 But... I'm not ready for that yet.#$b#$7There's still so much going on. I'm sorry.$7",
                "RejectMermaidPendant_NeedHouseUpgrade": "I'd love to, but... where would I live?$3 Your place is a little small for two... let alone for someone with as much energy as me!$0",
                "RejectMermaidPendant_Divorced": "You have the audacity to offer me that?$5 After what you did?$8 Get out of my sight.$8",
                
                "Fair_Judging": "Ooh, the judging! This is the most exciting part!$10 Let's see whose display has the best market appeal!$1",
                "Fair_Judged_PlayerWon": "You won first place! YES!$10 I knew you could do it! Your grange display was a masterpiece of presentation and product selection!$1",
                "Fair_Judged_PlayerLost": "Aw, tough break.$2 But hey, your display still had a lot of potential! We'll workshop some new strategies for next year!$0",

                "FlowerDance_Accept": "Dance with me? I thought you'd never ask!$4 Let's go show everyone how it's done!$10",
                "FlowerDance_Decline": "Oh! Uh, sorry.$2 I'm... not really in the mood for dancing right now. I've got a lot on my mind.$7",
                
                "WinterStar_GiveGift_Before_Spouse": "Happy Winter Star, my ember!$4 I was so excited to give you this. I really hope you love it!$9",
                "WinterStar_GiveGift_Before": "Happy Winter Star!$1 I saw this and immediately thought of you. I hope you like it!$4",
                "WinterStar_GiveGift_After_Spouse": "I'm so glad you like it!$9 Seeing you this happy is the only gift I'll ever need.$4",
                "WinterStar_GiveGift_After": "You like it! Great!$10 I have a knack for picking out the perfect thing, don't I?$1",

                "Oasis": "Welcome to the Calico Desert's number one tourist destination!$10 How can I help you today? Looking for seeds? Artifacts? Unbeatable deals?$1",
                "SeedShop_Tue": "Pierre's has a decent setup, but I see so much wasted potential.$6 He could easily triple his profits with a few of my marketing strategies.$0",

                "spring_Mon": "Monday! A fresh start to the week!$10 So many opportunities for success! What's your big plan for the day?$1",
                "summer_1": "Happy Summer!$10 The heat is on, which means it's peak tourist season! I'm absolutely buzzing with energy!$1",
                "fall_2": "The air is getting so crisp!$1 I'm thinking of a new marketing angle... 'Cozy Autumn Deals at the Oasis!' What do you think?$0",
                "winter_3": "Brrr! It's colder than a frozen tear out here!$3 Good thing business inside is always hot, hot, hot!$1",
                "Tue4": "Hey, @!$1 It's good to see a friendly face. I've been staring at shipping manifests all morning.$6",
                "Fri8": "It's Friday!$10 You know what that means? Time to project our weekend sales figures!$1 It's great seeing you, @.$4"
            }
        },
        
		{	
            ".LogName": "Edit Djinn spring13 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/spring13",
            "Entries": 
            {
                "Djinn":"This is so exciting!$10#$b#I bet that Vincent's going to be the winner this year!$1"
            }
        },
        {	
            ".LogName": "Edit Djinn spring24 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/spring24",
            "Entries": 
            {
                "Djinn":"Look at all the flowers! And the dresses!$4#$b#This festival has so much energy, I love it!$10"
            }
        },
        {	
            ".LogName": "Edit Djinn summer11 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/summer11",
            "Entries": 
            {
                "Djinn":"A party on the beach? In the middle of summer? YES PLEASE!$10#$b#This is my kind of festival! The heat feels just like home.$9"
            }
        },
        {	
            ".LogName": "Edit Djinn summer28 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/summer28",
            "Entries": 
            {
                "Djinn":"Wow... they're like little floating stars in the water.$10#$b#It's so beautiful it makes me want to cry happy tears! It's just... magical.$9"
            }
        },
        {	
            ".LogName": "Edit Djinn fall16 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/fall16",
            "Entries": 
            {
                "Djinn":"There's so much to see and do! Where do we even start?!$10#$b#I already tried the slingshot game three times. I'm getting better!$1"
            }
        },
        {	
            ".LogName": "Edit Djinn fall27 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/fall27",
            "Entries": 
            {
                "Djinn":"Ooh, a haunted maze! This looks like so much fun!$10#$b#Don't worry, if you get scared just stick close to me. I'm not afraid of anything!$1"
            }
        },
        {	
            ".LogName": "Edit Djinn winter8 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/winter8",
            "Entries": 
            {
                "Djinn":"Brrr! It's freezing out here!$5#$b#But I'm not letting a little cold stop me from winning that fishing competition! I've been practicing!$1"
            }
        },
        {	
            ".LogName": "Edit Djinn winter25 dialogue",
            "Action": "EditData",
            "Target": "Data/Festivals/winter25",
            "Entries": 
            {
                "Djinn":"Happy Winter Star! I've been looking forward to this all year!$10#$b#Giving gifts is the best part. Seeing everyone's happy faces makes me feel all warm inside!$4"
            }
        },

        {
            ".LogName": "Edit Djinn engaement dialogue",
            "Action": "EditData",
            "Target": "Data/EngagementDialogue",
            "Entries": {
                "Djinn0": "I still can't believe we're engaged!$4 I've been running some... uh... sales projections for the wedding.$1 It's going to be the event of the century!$10",
                "Djinn1": "Every time I look down at my hand, I just get this big, goofy grin on my face.$9 I can't wait to marry you, @.$4"
            }
        },

        {
            ".LogName": "Edit Djinn marraige dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/MarriageDialogueDjinn",
            "Entries": {
                "spring_14": "This farm is really thriving, my glow.$1 All your hard work is paying off. It's really inspiring to watch.$9",
                "summer_28": "Tonight's the Dance of the Moonlight Jellies!$10 I can't wait to watch them with you. It's so much more magical than watching them alone.$4",
                "fall_1": "Happy first day of Fall, my sandsong!$1 How about some spicy eel to celebrate the new season? My treat!$4",
                "winter_17": "It's so cold outside, but it's so warm in here with you.$9 I'm glad this is our home.$4",

                "patio_Djinn": "Just taking a little break and getting some sun.$9 It's nice to have a quiet moment with you, my ember.$4",

                "Rainy_Day_0": "The sound of the rain is nice... but I'm glad I'm in here with you.$4 It's a perfect day to stay in and... reorganize the pantry by expiration date!$1",
                "Rainy_Day_1": "I've already finished all my chores for the day.$1 That means more time to spend with my favorite farmer.$4",
                "Rainy_Day_2": "Mmm, I love the smell of rain on the soil.$9 It's so different from the desert. It smells like life.$1",
                "Rainy_Day_3": "This weather makes me want to just curl up with a good book.$6 ...A good book on advanced sales tactics, of course!$1",
                "Rainy_Day_4": "I left a little something for you in the kitchen, my ember.$1 Think of it as a thank you for being so wonderful.$4",

                "Indoor_Day_0": "Being a homebody with you is my new favorite hobby.$9 Don't tell Sandy, she'll think I've gone soft!$1",
                "Indoor_Day_1": "Just looking around at this amazing life we've built.$9 All my worries about fitting in... they just seem to melt away when I'm with you.$4",
                "Indoor_Day_2": "I was thinking we could expand the farm next season.$1 I've already drafted a five-step plan to maximize profits and cuteness! It involves more ducks.$10",
                "Indoor_Day_3": "Sometimes I just stop and watch you work.$6 You're so dedicated. It makes me want to work even harder, too!$1",
                "Indoor_Day_4": "Our home is my favorite place in the whole world.$9 Because you're here, my sandsong.$4",

                "Rainy_Night_0": "The storm sounds intense tonight.$3 Good thing we're safe and warm in here together.$9",
                "Rainy_Night_1": "Let the rain wash away all the worries of the day.$6 Tomorrow is a new beginning, my glow.$0",
                "Rainy_Night_2": "I feel like I could take on the world, as long as I have you to come home to.$9",
                "Rainy_Night_3": "Want to share some spicy eel and watch the lightning? It's kind of romantic, don't you think?$4",
                "Rainy_Night_4": "This kind of night makes me want to tell you all my secrets.$6 But you already know them all, don't you?$4",
                "Rainy_Night_5": "I used to be scared of storms when I was little.$7 But I'm not scared of anything when I'm with you.$9",

                "Indoor_Night_0": "The farm is so peaceful at night.$6 I used to think I needed constant noise and excitement... but being here with you is all I need.$9",
                "Indoor_Night_1": "Have you eaten dinner, my ember?$0 I can whip something up! My pepper poppers are almost famous in the Calico Desert!$1",
                "Indoor_Night_2": "Another successful day down.$1 Time to rest up and get ready to do it all again tomorrow!$0",
                "Indoor_Night_3": "Come sit with me for a while.$4 The chores can wait. I just want to be with my husband/wife.$9",
                "Indoor_Night_4": "I love you, my glow.$9 Just wanted to make sure you knew that.$4",
                "Indoor_Night_5": "I'm so proud of everything you've accomplished.$1 You've turned this place into something truly special.$9",

                "funReturn_Djinn": "I'm back!$10 I was visiting Sandy at the Oasis. She says hi!#$b#$1 It's a great shop, but it's not home.$9 Home is wherever you are, my sandsong.$4",
                
                "spring_Djinn": "The flowers blooming on the farm are so beautiful.$1 It gives me an idea for a new potpourri to sell at the shop! What do you think, a 'Pelican Town Spring' scent?$10",
                "summer_Djinn": "Whew, it's a hot one!$1 Reminds me of home. Let's make sure we both stay hydrated today, my ember.$4",
                "fall_Djinn": "My favorite part of fall is the colors.$9 It's like the whole world is a warm fire. Just like my love for you!$4 ...Was that cheesy? It felt cheesy.$1",
                "winter_Djinn": "It's cold, but our home is so warm and full of love.$9 I wouldn't trade it for all the gold in the desert.$4",
                
                "Outdoor_Djinn": "The farm air is so fresh!$10 Makes me want to run a few laps! It's all about productivity and personal health!$1",
                "Outdoor_0": "Ah, feels good to be outside.$1 A change of scenery is always good for business... and for the soul!$9",
                "Outdoor_1": "All this green is still a bit of a shock compared to the endless sand, but I'm getting used to it.$1 It's beautiful.$9",
                "Outdoor_2": "Checking on the animals.$0 They're our most valuable, non-crop assets! And they're cute, too.$1",
                "Outdoor_3": "This open space is amazing.$10 You can really think out here. No wonder you get so much done!$1",
                "Outdoor_4": "Looking at all the crops you've planted... it's amazing.$1 Your hard work is written all over this land.$9",
                "Outdoor_5": "Just enjoying the sun!$10 It feels almost as good as the desert sun.$1",
                
                "spouseRoom_Djinn": "This is my little corner of the world.$1 I've got my sales charts, my marketing plans... and a picture of you, of course.$4 It helps me stay focused on what's really important.$9",
                
                "OneKid_0": "Whew! Keeping up with %kid1 is a full-time job!$3 So much energy! I think they get it from me.$10",
                "OneKid_1": "I was telling %kid1 a story about the desert last night.$1 Their eyes were so wide! Maybe they'll be a little adventurer.$10",
                "OneKid_2": "Do you think we're doing a good job?$7 This whole parenting thing is harder than negotiating with a shipping company.$2 But... it's much more rewarding.$9",
                "OneKid_3": "I caught %kid1 trying to 'sell' their toys to the cat.$1 A future business prodigy, I'm telling you!$10",
                "OneKid_4": "Our little family is the best venture I've ever been a part of.$9 Thank you for building it with me, my glow.$4",
                
                "TwoKids_0": "%kid1 was helping %kid2 'organize' the toy chest today.$1 It looked like a cyclone hit it, but they were having so much fun!$9",
                "TwoKids_1": "It's amazing how different %kid1 and %kid2 are.$0 It's like managing two very different, very cute employees.$1",
                "TwoKids_2": "Our house is so full of noise and laughter now.$10 I love it. I wouldn't have it any other way.$9",
                "TwoKids_3": "I took the kids to see Sandy today.$1 She absolutely adores them. She kept calling them her little 'Sand Sprites'.$10",
                "TwoKids_4": "I promise I'll always work my hardest to provide for this family, my sandsong.$9 You and the kids are my world.$4",

                "Good_0": "I woke up with so much energy today!$10 I've already watered the crops, fed the animals, and drafted a three-point plan to increase our farm's quarterly earnings!$1 You're the best partner a Djinn could ask for, my ember!$4",
                "Good_1": "I made you a Triple Shot Espresso!$1 Go get 'em today, my glow! Seize the day and all that!$10",
                "Good_2": "I feel like I'm glowing today!$10 Must be your love. It's better than any cup of coffee!$4",
                "Good_3": "I feel invincible today!$1 Let's go out and make this the best, most profitable day ever!$10",
                "Good_4": "I reorganized all the chests this morning.$1 Now our workflow will be 15% more efficient! It's the little things that make a big difference!$10",
                "Good_5": "Everything is just... perfect.$9 Our farm, our family... you. I couldn't be happier.$4",
                "Good_6": "What a beautiful day!$10 Makes me want to run a special promotion! 'Buy one hug, get one kiss free!' Limited time offer for my favorite customer.$4",
                "Good_7": "I have so many amazing ideas today!$1 Our farm is going to be the most successful operation this side of the Gem Sea!$10",
                "Good_8": "Seeing you always puts a smile on my face.$4 No matter what kind of day I'm having.$9",
                "Good_9": "I love you so much!$10 Just wanted to say it again! I'll probably say it again in five minutes!$4",

                "Neutral_0": "Morning, my sandsong.$0 Did you sleep well? I was up a little late looking over some seed catalogues.$6",
                "Neutral_1": "Just another day on the farm.$0 Got a lot to do today. Let's get to it.$6",
                "Neutral_2": "Don't forget to eat breakfast, okay?$0 You need energy to get through the day.$6",
                "Neutral_3": "I'll handle some of the farm chores today, don't you worry.$0 We're a team, after all.$1",
                "Neutral_4": "I was just thinking about what to make for dinner.$0 Do you have any preferences?$6",
                "Neutral_5": "I wonder how Sandy and Emily are doing today.$0 I should probably send them a letter soon.$6",
                "Neutral_6": "The quiet life is... nice.$0 It's very different from what I'm used to, but it's a good kind of different.$6",
                "Neutral_7": "Just taking a moment to breathe.$0 It's easy to get caught up in the hustle and bustle, even here.$6",
                "Neutral_8": "Remember to take a break later, my glow.$0 Overworking leads to diminishing returns.$0",
                "Neutral_9": "Hm? Oh, sorry, I was a million miles away.$6 Just crunching some numbers in my head.$0",

                "Bad_0": "Ugh.$8 I had a nightmare that all our starfruit went bad right before we could ship it.$2 It just... felt a little too real, you know?$7",
                "Bad_1": "I'm just feeling a little insecure today, my sandsong.$7 Sometimes I still worry that I'm not pulling my weight around here... that you do everything.$2",
                "Bad_2": "I'm not feeling my usual peppy self today.$2 Maybe I just need a hug.$7",
                "Bad_3": "I got a letter from my old boss.$6 It wasn't mean or anything, but... it just brought back a lot of stressful memories.$7",
                "Bad_4": "I feel like a fraud sometimes.$7 All this energy... sometimes it's just a mask. Thanks for always seeing the real me, my glow.$2",
                "Bad_5": "I feel so tired today.$7 I don't really feel like talking, if that's okay.$2",
                "Bad_6": "Do you ever think about the desert?$7 I miss the dry heat sometimes. The way the sand sparkles at sunset.$2",
                "Bad_7": "I had that awful court case on my mind when I woke up.$7 I know it's over, but... it's hard to forget people hating you for what you are.$2",
                "Bad_8": "Sorry if I seem a little quiet.$7 I just don't have the energy to be 'on' today.$2",
                "Bad_9": "Is it okay if I'm not bubbly and loud today?$7 I still love you just as much. I'm just... feeling a little small.$2"
            }
        },

        {
            ".LogName": "Edit Djinn extra dialogue",
            "Action": "EditData",
            "Target": "Data/ExtraDialogue",
            "Entries": {
                "SummitEvent_Dialogue3_Djinn": "Looking out at the valley like this... it's amazing.$0#$b#For so long, I was scared of people finding out what I was. I thought they'd see my work as just... cheap magic.$7#$b#But you never did. You saw me. Just me.$2#$b#Being with you, my ember, gave me the confidence to be my true self. Thank you for giving me a home where I can truly shine.$4"
            },
            "When": null
        },

        {
            ".LogName": "Edit Djinn StringsFromMaps dialogue",
            "Action": "EditData",
            "Target": "Strings/StringsFromMaps",
            "Entries": {
                "Placeholder":""
            }
        },

        {
            ".LogName": "Edit Djinn stringsFromCSFiles dialogue",
            "Action": "EditData",
            "Target": "Strings/stringsFromCSFiles",
            "Entries": {
                "Djinn_AfterWedding": "We did it! We're actually married!$10 I promise to be the most exciting, supportive, and... passionate wife ever!$4 My ember, our future together is going to be dazzling!$9",
                "Djinn_Engaged": "I... I don't even know what to say!$3 Is this really happening?! YES! A thousand times, yes!$9 I'm going to be the happiest Djinn in the entire world!$4"
            }
        },
        
        {
            ".LogName": "Edit Djinn move dialogue",
            "Action": "EditData",
            "Target": "Strings/movieReactions",
            "Entries": {
                "Djinn_love_movie_BeforeMovie": "Ooh! I've been wanting to see this one! I have a feeling it's gonna be great!$10",
                "Djinn_love_movie_DuringMovie": "YES! That was AWESOME! This is the best movie ever!$3",
                "Djinn_love_movie_AfterMovie": "That was incredible! Action, laughs, everything!$10#$b#We should totally see it again sometime!$1",
                "Djinn_like_movie_BeforeMovie": "This looks like it could be fun. Let's get some snacks!$1",
                "Djinn_like_movie_DuringMovie": "Aww, that was really sweet.$4",
                "Djinn_like_movie_AfterMovie": "I liked that! It was a nice way to spend the evening.$0#$b#Thanks for inviting me, @.$4",
                "Djinn_dislike_movie_BeforeMovie": "Hmm. Are you sure about this one?$6#$b#Well, okay. I'll give it a shot.$0",
                "Djinn_dislike_movie_DuringMovie": "Is it... over yet? I think I need a triple shot espresso to stay awake.$7",
                "Djinn_dislike_movie_AfterMovie": "Well... that was certainly a movie.$6#$b#Let's... maybe see something with a little more pizzazz next time?$0"
            }
        },

        {
            "Action": "EditData",
            "Target": "Data/movieReactions",
            "Entries": {
                "Placeholder":""
            }
        },
        
        {
            ".LogName": "Edit Djinn animation strings",
            "Action": "EditData",
            "Target": "Strings/animationDescriptions",
            "Entries": {
                "Placeholder":""
            }
        },
        {
            ".LogName": "Edit Djinn animations",
            "Action": "EditData",
            "Target": "Data/animationDescriptions",
            "Entries": {
                "Placeholder":""
            }
        },
        {
            ".LogName": "Edit Djinn schedule",
            "Action": "EditData",
            "Target": "Characters/Schedules/Djinn",
            "Entries": {
                "Placeholder":""
            }
        },

        {
            ".LogName": "Edit FRIEND_1 dialogue for the Djinn",
            "Action": "EditData",
            "Target": "Characters/Dialogue/FRIEND_1",
            "Entries": {
                "Placeholder":""
            }
        }
    ]
}
